Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures.Nested
Cannot have nested Plan Regions.

Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures.InvalidPlanRegionError
Plan region is invalid. The sketch of a plan region may not contain intersecting, overlapping or nested loops.

Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures.InvalidPlanRegion
Plan region is invalid. The sketch of a plan region may not contain intersecting, overlapping or nested loops.

Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures.Intersecting
The boundaries of the highlighted Plan Regions overlap.

Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures.DeletedViewRangeLevel
Deleted level was used to define plan region's view range.\r\nReplace deleted level by level of parent view and adjust offset?

Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures
Failures about PlanRegion.